Gauchada/app/controllers/favors_controller.rb

	def index
		@favors = Favor.all
---
SELECT "favors".* FROM "favors"  ORDER BY created_at desc

	def show
		@favor = Favor.find(params[:id])
---
SELECT  "favors".* FROM "favors" WHERE "favors"."id" = $1  ORDER BY created_at desc LIMIT 1  [["id", 1]]