Gauchada/app/controllers/logros_controller.rb

SELECT "logros".* FROM "logros"  ORDER BY puntaje_max desc
---
	def index
		if isAdmin?
			@logros = Logro.all

SELECT  "logros".* FROM "logros" WHERE "logros"."id" = ?  ORDER BY puntaje_max desc LIMIT 1  [["id", 1]]
---
	def edit
		if isAdmin?
			@logro = Logro.find(params[:id])

SELECT  "logros".* FROM "logros" WHERE "logros"."id" = $1  ORDER BY puntaje_max desc LIMIT 1  [["id", 1]]
---
	def destroy
		logro = Logro.find(params[:id])