Gauchada/app/views/logros/index.html.erb


	<% Logro.all.each do |logro| %>
---
SELECT "logros".* FROM "logros"  ORDER BY puntaje_max desc