Gauchada/app/views/favors/show.html.erb

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."favor_id" = $1 AND "comentarios"."id" = $2 LIMIT 1  [["favor_id", 4], ["id", 1]]
---
					<% i = 1 %>
					<% @favor.comentario.each do |c| %>